Revit 2027 API
DuctFittingAndAccessoryPressureDropItem.VelocityPressure Property
 The velocity pressure, for converting between coefficient and pressure drop on this flow path. Units: (kg/(ft·s²)).
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double VelocityPressure { get; }
Public ReadOnly Property VelocityPressure As Double
	Get
public:
property double VelocityPressure {
	double get ();
}
member VelocityPressure : float with get
Property Value
Double
See Also
Reference
DuctFittingAndAccessoryPressureDropItem Class
Autodesk.Revit.DB.Mechanical Namespace